/*********************************************************
 * config.h - файл, в котором надо заменить значения CPE 
 	для вашей машины для наивных реализаций
 	оптимизируемых функций 
 *********************************************************/
#ifndef _CONFIG_H_
#define _CONFIG_H_

/* 
 * Заполните значеними CPE для базовой (наивной) версии функции
 * поворота изображения на вашей машине.
 * Запустите ./driver, чтобы получить приведенные значения и 
 * впишите вместо предложенных.
 */
#define R64    1.5
#define R128   2.2
#define R256   4.1
#define R512   7.6
#define R1024  7.2

/* 
 * Заполните значеними CPE для базовой (наивной) версии функции
 * сглаживания изображения на вашей машине.
 * Запустите ./driver, чтобы получить приведенные значения и 
 * впишите вместо предложенных.
 */
#define S32   33.8
#define S64   33.7
#define S128  33.6
#define S256  33.9
#define S512  33.2


#endif /* _CONFIG_H_ */
